package th.ac.utd.surfaceareaandvolumegeometry;

public class QuestionLibrary {

    public static String[] questions = new String [] {
            "สูตรการหาพื้นที่ผิวของทรงกลมคือ\n4πr^2",
            "สูตรการหาปริมาตรของพีระมิดคือ\nพื้นที่ฐาน x ความสูง / 2",
            "สูตรการหาปริมาตรของทรงกระบอกคือ\nπr^2 x ความสูง",
            "สูตรการหาพื้นที่ผิวของปริซึมคือ\nความยาวของเส้นรอบรูป x ความสูง",
            "สูตรการหาปริมาตรของกรวยคือ\nπr^2 x ความสูง",
    };

    public static int[] images = new int [] {
            R.drawable.sphere, R.drawable.pyramidd, R.drawable.cylinder, R.drawable.prism,
            R.drawable.cone
    };

    public static boolean[] answers = new boolean[]{
            true, false, true, false, false
    };
}
/*
public static String[] mQuestions = new String[] {
            "พีระมิดฐานสี่เหลี่ยมจัตุรัสมีฐานยาวด้านละ 10 ซม. ถ้าความสูงของพีระมิดเป็น 12 ซม. ปริมาตรของพีระมิดจะเป็นเท่าใด?",
            "รัศมีของฐานของกรวยเป็น 4 หน่วย และมีสูงเอียงเป็น 9 หน่วย แล้วพื้นที่ผิวทั้งหมดของกรวยเป็นเท่าใด?",
            "ถังน้ำทรงกระบอกมีรัศมี 5 เมตร สูง 21 เมตร มีน้ำอยู่เต็มถัง ปริมาตรของน้ำเป็นเท่าใด?",
            "ลูกฟุตบอลทรงกลมลูกหนึ่ง มีเส้นผ่านศุนย์กลาง 14 ซม. พื้นที่ผิวโดยประมาณเป็นเท่าใด?",
            "ปริซึมฐานสี่เหลี่ยมจัตุรัส มีเส้นรอบรูปฐานยาว 48 ซม. มีความสูง 1 เมตร ปริซึมนี้มีปริมาตรกี่ซม?",
    };

public String mChoices [][] = {
            {"1,200", "400", "240"},
            {"52", "36", "48"},
            {"330", "1,560", "1,650"},
            {"616", "154", "2,464"},
            {"230,400", "14,400", "144"}
    };



private String mCorrectAnswers[] = {"400", "52", "1,650", "616", "14,400"};
 */